In [1]:
import pyodbc
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
from matplotlib import style
style.use('fivethirtyeight')

# QUERY 0: All Employee Operations

In [2]:
# Connect to the Database
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "Trusted_Connection=yes;")

In [3]:
df = pd.read_sql_query("select w.name Warehouse, p.name Customer, t.employee Employee, oc.name Operation, t.completedDateTime,\
        ot.name OrderType, occ.name OrderClass, o.lookupCode OrderNumber, s.lookupCode ShipmentNumber, t.actualInventoryAmount Quantity\
    from datex_footprint.tasks t\
        join datex_footprint.OperationCodes oc\
            on oc.id = t.operationCodeId\
        left join datex_footprint.Warehouses w\
            on w.id = t.warehouseId\
        left join datex_footprint.Projects p\
            on p.id = t.projectId\
        left join datex_footprint.orders o\
            on o.id = t.orderId\
        left join datex_footprint.Shipments s\
            on s.id = t.shipmentId\
        left join datex_footprint.OrderTypes ot\
            on ot.id = s.typeId\
        left join datex_footprint.OrderClasses occ\
            on occ.id = o.orderClassId\
    where t.completedDateTime >= '2022-04-01' and\
            t.employee  not in ('Foot Print Service', 'FootPrintService', 'Carl Ambroise', 'Julio Meza', 'Rodmann Ramos', 'Auto Move') and\
            oc.id not in (2055, 2056, 2058, 2066, 2068, 2065, 2064, 17, 18, 27, 2057, 22, 19) and\
            w.id not in (7, 10, 11, 15, 17, 18, 19)\
    order by w.name, p.name, t.employee, oc.name, t.operationCodeId", cnxn)

In [6]:
# Group Employees into Roles

df.loc[df['Employee']=='Aisha Cooper','Role'] = 'Technician'
df.loc[df['Employee']=='Alejandro Aguirre','Role'] = 'Technician'
df.loc[df['Employee']=='Andre Jocelin','Role'] = 'Technician'
df.loc[df['Employee']=='Andre Nau','Role'] = 'Technician'

df.loc[df['Employee']=='Angel Luna','Role'] = 'Technician'
df.loc[df['Employee']=='Angela Briceno','Role'] = 'Coordinator'
df.loc[df['Employee']=='Angela Pena','Role'] = 'Coordinator'
df.loc[df['Employee']=='Baldomero Ramos','Role'] = 'Technician' ##### Duplicate Name

df.loc[df['Employee']=='Brad Bacchetti','Role'] = 'Coordinator'
df.loc[df['Employee']=='Brittany Owen','Role'] = 'Technician'
df.loc[df['Employee']=='Caleb Naranjo','Role'] = 'Technician'
df.loc[df['Employee']=='Carl Ambroise','Role'] = 'IT'

df.loc[df['Employee']=='Carlos Chavez','Role'] = 'Technician'
df.loc[df['Employee']=='Carlos Gomez','Role'] = 'Technician'
df.loc[df['Employee']=='Carly Potts','Role'] = 'Coordinator'
df.loc[df['Employee']=='Carolina Martinez','Role'] = 'Warehuose Manager'

df.loc[df['Employee']=='Casey Brown','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Chris Martin','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Cristian Correa','Role'] = 'Warehuose Manager'

df.loc[df['Employee']=='Dan Parisi','Role'] = 'Coordinator'
df.loc[df['Employee']=='Danielle Lucas','Role'] = 'Coordinator'

df.loc[df['Employee']=='Diana Martinez','Role'] = 'Technician'
df.loc[df['Employee']=='Diego Londono','Role'] = 'Technician'
df.loc[df['Employee']=='Djenyson Sanon','Role'] = 'Technician'
df.loc[df['Employee']=='Dyenyson Sanon','Role'] = 'Technician'

df.loc[df['Employee']=='Doris Hernandez','Role'] = 'Coordinator'
df.loc[df['Employee']=='Doris Hincapie','Role'] = 'Technician'
df.loc[df['Employee']=='Edilberto Souza','Role'] = 'Technician'
df.loc[df['Employee']=='Edwin Perez','Role'] = 'Technician'

df.loc[df['Employee']=='Ernest Ferguson','Role'] = 'Technician'
df.loc[df['Employee']=='Felix Blanco','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Frantz Laman','Role'] = 'Technician'
df.loc[df['Employee']=='Gabriela Sanchez','Role'] = 'Coordinator'

df.loc[df['Employee']=='Gonzalo Guzman','Role'] = 'Technician'
df.loc[df['Employee']=='Gregory Watts','Role'] = 'Technician'
df.loc[df['Employee']=='Haydee Moreno','Role'] = 'Technician'
df.loc[df['Employee']=='Hector Gonzalez','Role'] = 'Technician'

df.loc[df['Employee']=='Hernando Sanchez','Role'] = 'Technician'
df.loc[df['Employee']=='Hugo Gonzales','Role'] = 'Technician'
df.loc[df['Employee']=='Isaiah Lyng','Role'] = 'Technician'
df.loc[df['Employee']=='Jackson Pierre','Role'] = 'Technician'

df.loc[df['Employee']=='Jairo Rincon','Role'] = 'Technician'
df.loc[df['Employee']=='Jamarcus Cook','Role'] = 'Technician'
df.loc[df['Employee']=='Janeth Briceno','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Jayalakshmi Arcot','Role'] = 'Coordinator'

df.loc[df['Employee']=='Jaycob Albert','Role'] = 'Technician'
df.loc[df['Employee']=='John Puskarik','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Johnn Thompsonn','Role'] = 'Technician'
df.loc[df['Employee']=='Jorge Lopez','Role'] = 'Technician'
df.loc[df['Employee']=='Jose Rodriguez','Role'] = 'Technician'

df.loc[df['Employee']=='Juan Castro','Role'] = 'Technician'
df.loc[df['Employee']=='Juan Morales','Role'] = 'Coordinator'
df.loc[df['Employee']=='Julio Meza','Role'] = 'IT'
df.loc[df['Employee']=='Justin Johnson','Role'] = 'Technician'

df.loc[df['Employee']=='Justin Runsdorf','Role'] = 'Coordinator'
df.loc[df['Employee']=='Karen Hernandez','Role'] = 'Technician'
df.loc[df['Employee']=='Katherine Moncada','Role'] = 'Technician'
df.loc[df['Employee']=='Keith Barker','Role'] = 'Technician'

df.loc[df['Employee']=='Lazaro Galindo','Role'] = 'Technician'
df.loc[df['Employee']=='Liliana Puentes','Role'] = 'Technician'
df.loc[df['Employee']=='Luci Nicley','Role'] = 'Technician'
df.loc[df['Employee']=='Maria Ramos','Role'] = 'Technician'

df.loc[df['Employee']=='Martha Hurtado','Role'] = 'Technician'
df.loc[df['Employee']=='Marzetta Bracken','Role'] = 'Technician'
df.loc[df['Employee']=='Matthew Gordon','Role'] = 'Coordinator'
df.loc[df['Employee']=='Matthew Shipley','Role'] = 'Coordinator'

df.loc[df['Employee']=='Micah Powers','Role'] = 'Technician'
df.loc[df['Employee']=='Misael Flores','Role'] = 'Technician'
df.loc[df['Employee']=='Mysel Pichardo','Role'] = 'Coordinator'
df.loc[df['Employee']=='Nelson Hurtado','Role'] = 'Technician'

df.loc[df['Employee']=='Nicklas Schmidt','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Odessa Sullen','Role'] = 'Technician'
df.loc[df['Employee']=='Omar Robles','Role'] = 'Coordinator'
df.loc[df['Employee']=='Ramos Baldomero','Role'] = 'Coordinator' ##### Duplicate Name

df.loc[df['Employee']=='Raul Bejarano','Role'] = 'Technician'
df.loc[df['Employee']=='Reggie Bracken','Role'] = 'Technician'
df.loc[df['Employee']=='Rita Geldres','Role'] = 'Technician'
df.loc[df['Employee']=='Robert Halm','Role'] = 'Technician'

df.loc[df['Employee']=='Rodmann Ramos','Role'] = 'IT'

df.loc[df['Employee']=='Ronald Celis','Role'] = 'Technician'
df.loc[df['Employee']=='Sandra Alvarez','Role'] = 'Technician'
df.loc[df['Employee']=='Sandra Vega','Role'] = 'Technician'
df.loc[df['Employee']=='Sergio Piura','Role'] = 'Warehuose Manager'

df.loc[df['Employee']=='Shannon Williamson','Role'] = 'Warehuose Manager'
df.loc[df['Employee']=='Shawn Saunders','Role'] = 'Technician'
df.loc[df['Employee']=='Shipping','Role'] = 'Anybody'
df.loc[df['Employee']=='Sujelin Soto-Orta','Role'] = 'Technician'

df.loc[df['Employee']=='Thalia Rivera','Role'] = 'Coordinator'
df.loc[df['Employee']=='Tyler Gonzales','Role'] = 'Technician'
df.loc[df['Employee']=='Warehouse','Role'] = 'Anybody'
df.loc[df['Employee']=='Wayne Gray','Role'] = 'Technician'

df.loc[df['Employee']=='Wendy Medrano','Role'] = 'Technician'
df.loc[df['Employee']=='William Trevino Trevino','Role'] = 'Technician'
df.loc[df['Employee']=='Yaima Castillo','Role'] = 'Technician'
df.loc[df['Employee']=='Yulieth Aguirre','Role'] = 'Coordinator'
df.loc[df['Employee']=='yudisel tubella','Role'] = 'Technician'

df['Role'].fillna('Other', inplace=True)

df.head()

,Warehouse,Customer,Employee,Operation,completedDateTime,OrderType,OrderClass,OrderNumber,ShipmentNumber,Quantity,Role
0,10,None,Andre Jocelin,Accelerated Expiration Override,2022-04-11 17:06:46.980,None,None,None,None,NaN,Technician
1,10,None,Andre Jocelin,Accelerated Expiration Override,2022-04-11 17:06:47.277,None,None,None,None,NaN,Technician
2,10,None,Andre Jocelin,Accelerated Expiration Override,2022-04-11 17:05:23.327,None,None,None,None,NaN,Technician
3,10,None,Andre Jocelin,Accelerated Expiration Override,2022-04-12 12:41:48.953,None,None,None,None,NaN,Technician
4,10,None,Andre Jocelin,Accelerated Expiration Override,2022-04-12 12:43:11.787,None,None,None,None,NaN,Technician

In [7]:
# Displaying New Employees
df.loc[df['Role'] == 'Other']

,Warehouse,Customer,Employee,Operation,completedDateTime,OrderType,OrderClass,OrderNumber,ShipmentNumber,Quantity,Role
6359,10,None,WOODFIELD\jarcot,UnPick LicensePlate,2022-04-05 16:42:50.713,Outbound,None,None,MET207798 (C6224754),NaN,Other
35245,15,None,WOODFIELD\cmartinez,UnPick LicensePlate,2022-04-18 11:54:55.273,Outbound,None,None,7901684 (C6343397),NaN,Other

In [8]:
df.drop(df.loc[df['Employee']=='WOODFIELD\jarcot'].index, inplace=True)
df.drop(df.loc[df['Employee']=='WOODFIELD\cmartinez'].index, inplace=True)
df.loc[df['Role'] == 'Other']

Empty DataFrame
Columns: [Warehouse, Customer, Employee, Operation, completedDateTime, OrderType, OrderClass, OrderNumber, ShipmentNumber, Quantity, Role]
Index: []

In [9]:
# Save data in tableau pickers
df.to_csv('data/tableau_employee_opearions.csv')
df.tail()

,Warehouse,Customer,Employee,Operation,completedDateTime,OrderType,OrderClass,OrderNumber,ShipmentNumber,Quantity,Role
104362,22,"NBTY Global, Inc.",William Trevino Trevino,Picking,2022-04-04 11:29:02.693,Outbound,Sales Order,610152,610152,1.0,Technician
104363,22,"NBTY Global, Inc.",William Trevino Trevino,Picking,2022-04-04 11:25:32.717,Outbound,Sales Order,610152,610152,1.0,Technician
104364,22,"NBTY Global, Inc.",William Trevino Trevino,Picking,2022-04-04 11:17:40.563,Outbound,Sales Order,610152,610152,1.0,Technician
104365,22,"NBTY Global, Inc.",William Trevino Trevino,Picking,2022-04-04 11:25:21.263,Outbound,Sales Order,610152,610152,1.0,Technician
104366,22,"NBTY Global, Inc.",William Trevino Trevino,Picking,2022-04-04 11:20:49.867,Outbound,Sales Order,610152,610152,1.0,Technician

In [125]:
# Close connection
cnxn.close()

# QUERY 1: Picking Performance (Orders and Waves)

In [3]:
# SELECT @from = getdate(), @to = dateadd(day, 1, getdate());\

In [10]:
# Connect to the Database
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "Trusted_Connection=yes;")

In [22]:
df = pd.read_sql_query("DECLARE @from date, @to date;\
                          SELECT @from = '2022-04-27', @to = '2022-04-28';\
    SELECT t.completedDateTime Date, oc.name Operation, w.name Warehouse,\
           p.name Project, m.lookupCode Material, employee Employee, s.lookupCode Shipment, isnull(s.waveId, ps.waveId) Wave,\
           ordersPerWave.shipmentsCount, lc.name Location, o.orderClassId\
    FROM datex_footprint.Tasks t\
        join datex_footprint.OperationCodes oc\
            on oc.id = t.operationCodeId\
        left join datex_footprint.Warehouses w\
            on w.id = t.warehouseId\
        left join datex_footprint.Projects p\
            on p.id = t.projectId\
        left join datex_footprint.Materials m\
            on m.id = t.materialId\
        left join datex_footprint.Shipments s\
        inner join datex_footprint.ShipmentOrderLookup sol\
        inner join datex_footprint.orders o\
            on o.id = sol.orderId\
            on sol.shipmentId = s.id\
            on s.id = t.shipmentId\
        left join datex_footprint.PickSlips ps\
            on ps.id = t.pickSlipId\
        left join datex_footprint.LocationContainers lc\
            on lc.id = t.actualSourceLocationId\
        outer apply (\
            select\
                count(distinct tt.shipmentId) shipmentsCount\
                from datex_footprint.waves ww\
                    inner join datex_footprint.PickSlips ppss\
                    inner join datex_footprint.tasks tt\
                        on tt.operationCodeId = 8 and tt.pickSlipId = ppss.id\
                        on ppss.waveId = ww.id\
                where ww.id = isnull(s.waveId, ps.waveId)) ordersPerWave\
    where t.completedDateTime >= @from and t.completedDateTime < @to and t.statusId = 2 and isnull(o.orderClassId, 0) not in (23, 24, 36) and s.lookupCode not like '%TEST%'\
    and t.operationCodeId in (8, 39, 2064, 2065, 2066, 2067, 2068) and t.employee != 'Foot Print Service'\
    order by s.lookupCode, t.completedDateTime", cnxn)

In [23]:
df.tail(3)

,Date,Operation,Warehouse,Project,Material,Employee,Shipment,Wave,shipmentsCount,Location,orderClassId
1176,2022-04-27 09:02:53.040,Picking,19,"GCH Granules USA, Inc.",200000001844,Brad Bacchetti,TR-RHCL-Care-04272022,235416.0,1,37-04-05-A,2
1177,2022-04-27 09:03:21.947,Picking,19,"GCH Granules USA, Inc.",700000001360,Brad Bacchetti,TR-RHCL-Care-04272022,235416.0,1,37-11-04-A,2
1178,2022-04-27 09:04:03.773,Picking Completed,19,"GCH Granules USA, Inc.",None,Brad Bacchetti,TR-RHCL-Care-04272022,235416.0,1,None,2

In [24]:
# Order Columns
df = df[['Warehouse', 'Project', 'Wave', 'Shipment', 'Date', 'Operation', 'Employee',
         'Location', 'shipmentsCount', 'Material']]

In [25]:
df['Operation'].unique()

array(['Scanned Shipment', 'Picking', 'Picking Completed',
       'Rate And Ship', 'Picking Initiated PC'], dtype=object)

### Filter by Shipments

In [26]:
# Filter by Orders only
df_orders = df.loc[(df['Operation']=='Picking') |
                   (df['Operation']=='Scanned Shipment') |
                   (df['Operation']=='Picking Completed')]

df_orders = df_orders[['Warehouse', 'Project', 'Shipment', 'Date', 'Operation', 'Employee', 'Location']]

df_orders.head()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location
0,10,ISDIN Corporation,0085619930,2022-04-27 11:23:46.337,Scanned Shipment,Ronald Celis,None
1,10,ISDIN Corporation,0085619930,2022-04-27 11:23:59.540,Picking,Ronald Celis,34-01-01-A
2,10,ISDIN Corporation,0085619930,2022-04-27 11:24:03.227,Picking Completed,Ronald Celis,None
3,10,ISDIN Corporation,0085619931,2022-04-27 10:59:19.327,Scanned Shipment,Ronald Celis,None
4,10,ISDIN Corporation,0085619931,2022-04-27 10:59:43.330,Picking,Ronald Celis,33-07-02-A

In [27]:
# Create a new column with the time difference between rows
df_orders['PickingTime'] = df_orders['Date'].diff()
df_orders.head()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime
0,10,ISDIN Corporation,0085619930,2022-04-27 11:23:46.337,Scanned Shipment,Ronald Celis,None,NaT
1,10,ISDIN Corporation,0085619930,2022-04-27 11:23:59.540,Picking,Ronald Celis,34-01-01-A,0 days 00:00:13.203000
2,10,ISDIN Corporation,0085619930,2022-04-27 11:24:03.227,Picking Completed,Ronald Celis,None,0 days 00:00:03.687000
3,10,ISDIN Corporation,0085619931,2022-04-27 10:59:19.327,Scanned Shipment,Ronald Celis,None,-1 days +23:35:16.100000
4,10,ISDIN Corporation,0085619931,2022-04-27 10:59:43.330,Picking,Ronald Celis,33-07-02-A,0 days 00:00:24.003000

In [28]:
# Add Hour, Minute and Second columns
df_orders['hour'] = df_orders['PickingTime'].dt.components['hours']
df_orders['minute'] = df_orders['PickingTime'].dt.components['minutes']
df_orders['second'] = df_orders['PickingTime'].dt.components['seconds']
df_orders.head()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime,hour,minute,second
0,10,ISDIN Corporation,0085619930,2022-04-27 11:23:46.337,Scanned Shipment,Ronald Celis,None,NaT,NaN,NaN,NaN
1,10,ISDIN Corporation,0085619930,2022-04-27 11:23:59.540,Picking,Ronald Celis,34-01-01-A,0 days 00:00:13.203000,0.0,0.0,13.0
2,10,ISDIN Corporation,0085619930,2022-04-27 11:24:03.227,Picking Completed,Ronald Celis,None,0 days 00:00:03.687000,0.0,0.0,3.0
3,10,ISDIN Corporation,0085619931,2022-04-27 10:59:19.327,Scanned Shipment,Ronald Celis,None,-1 days +23:35:16.100000,23.0,35.0,16.0
4,10,ISDIN Corporation,0085619931,2022-04-27 10:59:43.330,Picking,Ronald Celis,33-07-02-A,0 days 00:00:24.003000,0.0,0.0,24.0

In [29]:
# Set all the Scanned Shipment hour, minute, time to ZERO

df_orders.loc[df_orders.Operation == 'Scanned Shipment', 'hour'] = 0.0
df_orders.loc[df_orders.Operation == 'Scanned Shipment', 'minute'] = 0.0
df_orders.loc[df_orders.Operation == 'Scanned Shipment', 'second'] = 0.0

df_orders.loc[df_orders['Operation'] == 'Scanned Shipment'].head()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime,hour,minute,second
0,10,ISDIN Corporation,0085619930,2022-04-27 11:23:46.337,Scanned Shipment,Ronald Celis,None,NaT,0.0,0.0,0.0
3,10,ISDIN Corporation,0085619931,2022-04-27 10:59:19.327,Scanned Shipment,Ronald Celis,None,-1 days +23:35:16.100000,0.0,0.0,0.0
10,10,ISDIN Corporation,0085619932,2022-04-27 11:24:14.337,Scanned Shipment,Ronald Celis,None,0 days 00:20:52.674000,0.0,0.0,0.0
17,10,ISDIN Corporation,0085619934,2022-04-27 11:09:35.817,Scanned Shipment,Ronald Celis,None,-1 days +23:42:11.210000,0.0,0.0,0.0
27,10,ISDIN Corporation,0085619967,2022-04-27 11:31:05.783,Scanned Shipment,Ronald Celis,None,0 days 00:12:32.766000,0.0,0.0,0.0

In [30]:
df_orders['Time'] = df_orders['hour']*60 + df_orders['minute'] + df_orders['second']/60
df_orders.head()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime,hour,minute,second,Time
0,10,ISDIN Corporation,0085619930,2022-04-27 11:23:46.337,Scanned Shipment,Ronald Celis,None,NaT,0.0,0.0,0.0,0.000000
1,10,ISDIN Corporation,0085619930,2022-04-27 11:23:59.540,Picking,Ronald Celis,34-01-01-A,0 days 00:00:13.203000,0.0,0.0,13.0,0.216667
2,10,ISDIN Corporation,0085619930,2022-04-27 11:24:03.227,Picking Completed,Ronald Celis,None,0 days 00:00:03.687000,0.0,0.0,3.0,0.050000
3,10,ISDIN Corporation,0085619931,2022-04-27 10:59:19.327,Scanned Shipment,Ronald Celis,None,-1 days +23:35:16.100000,0.0,0.0,0.0,0.000000
4,10,ISDIN Corporation,0085619931,2022-04-27 10:59:43.330,Picking,Ronald Celis,33-07-02-A,0 days 00:00:24.003000,0.0,0.0,24.0,0.400000

In [44]:
# Save in JSON Format for HTML
#df_grouped = df_orders.groupby(['Warehouse', 'Project', 'Shipment', 'Operation', 'Date'])[['Time']].sum().sort_values(['Warehouse', 'Project', 'Shipment', 'Date'])
#df_grouped.to_json('data/performance.json', orient='table')
#df_grouped.head(20)

### Removing First and last transaction

In [31]:
# Remove Operation 'Scanned Shipment' and 'Picking Completed'
df_excluded = df_orders.loc[(df_orders['Operation'] != 'Scanned Shipment') &
                            (df_orders['Operation'] != 'Picking Completed')]
df_excluded.head()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime,hour,minute,second,Time
1,10,ISDIN Corporation,0085619930,2022-04-27 11:23:59.540,Picking,Ronald Celis,34-01-01-A,0 days 00:00:13.203000,0.0,0.0,13.0,0.216667
4,10,ISDIN Corporation,0085619931,2022-04-27 10:59:43.330,Picking,Ronald Celis,33-07-02-A,0 days 00:00:24.003000,0.0,0.0,24.0,0.400000
5,10,ISDIN Corporation,0085619931,2022-04-27 11:00:20.423,Picking,Ronald Celis,33-05-01-A,0 days 00:00:37.093000,0.0,0.0,37.0,0.616667
6,10,ISDIN Corporation,0085619931,2022-04-27 11:01:28.177,Picking,Ronald Celis,34-05-01-A,0 days 00:01:07.754000,0.0,1.0,7.0,1.116667
7,10,ISDIN Corporation,0085619931,2022-04-27 11:02:42.723,Picking,Ronald Celis,34-01-01-A,0 days 00:01:14.546000,0.0,1.0,14.0,1.233333

In [46]:
# Group Employees into Roles

df_excluded.loc[df_excluded['Employee']=='Aisha Cooper','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Alejandro Aguirre','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Andre Jocelin','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Andre Nau','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Angel Luna','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Angela Briceno','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Angela Pena','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Baldomero Ramos','Role'] = 'Technician' ##### Duplicate Name

df_excluded.loc[df_excluded['Employee']=='Brad Bacchetti','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Brittany Owen','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Caleb Naranjo','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Carl Ambroise','Role'] = 'IT'

df_excluded.loc[df_excluded['Employee']=='Carlos Chavez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Carlos Gomez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Carly Potts','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Carolina Martinez','Role'] = 'Warehuose Manager'

df_excluded.loc[df_excluded['Employee']=='Casey Brown','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Chris Martin','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Dan Parisi','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Danielle Lucas','Role'] = 'Coordinator'

df_excluded.loc[df_excluded['Employee']=='Diana Martinez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Diego Londono','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Djenyson Sanon','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Dyenyson Sanon','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Doris Hernandez','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Doris Hincapie','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Edilberto Souza','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Edwin Perez','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Ernest Ferguson','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Felix Blanco','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Frantz Laman','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Gabriela Sanchez','Role'] = 'Coordinator'

df_excluded.loc[df_excluded['Employee']=='Gonzalo Guzman','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Gregory Watts','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Haydee Moreno','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Hector Gonzalez','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Hernando Sanchez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Hugo Gonzales','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Isaiah Lyng','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Jackson Pierre','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Jairo Rincon','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Jamarcus Cook','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Janeth Briceno','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Jayalakshmi Arcot','Role'] = 'Coordinator'

df_excluded.loc[df_excluded['Employee']=='Jaycob Albert','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='John Puskarik','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Jorge Lopez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Jose Rodriguez','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Juan Castro','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Juan Morales','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Julio Meza','Role'] = 'IT'
df_excluded.loc[df_excluded['Employee']=='Justin Johnson','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Justin Runsdorf','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Karen Hernandez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Katherine Moncada','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Keith Barker','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Lazaro Galindo','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Liliana Puentes','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Luci Nicley','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Maria Ramos','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Martha Hurtado','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Marzetta Bracken','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Matthew Gordon','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Matthew Shipley','Role'] = 'Coordinator'

df_excluded.loc[df_excluded['Employee']=='Micah Powers','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Misael Flores','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Mysel Pichardo','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Nelson Hurtado','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Nicklas Schmidt','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Odessa Sullen','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Omar Robles','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Ramos Baldomero','Role'] = 'Coordinator' ##### Duplicate Name

df_excluded.loc[df_excluded['Employee']=='Raul Bejarano','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Reggie Bracken','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Rita Geldres','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Rodmann Ramos','Role'] = 'IT'

df_excluded.loc[df_excluded['Employee']=='Ronald Celis','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Sandra Alvarez','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Sandra Vega','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Sergio Piura','Role'] = 'Warehuose Manager'

df_excluded.loc[df_excluded['Employee']=='Shannon Williamson','Role'] = 'Warehuose Manager'
df_excluded.loc[df_excluded['Employee']=='Shawn Saunders','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Shipping','Role'] = 'Anybody'
df_excluded.loc[df_excluded['Employee']=='Sujelin Soto-Orta','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Thalia Rivera','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='Tyler Gonzales','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Warehouse','Role'] = 'Anybody'
df_excluded.loc[df_excluded['Employee']=='Wayne Gray','Role'] = 'Technician'

df_excluded.loc[df_excluded['Employee']=='Wendy Medrano','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='William Trevino Trevino','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Yaima Castillo','Role'] = 'Technician'
df_excluded.loc[df_excluded['Employee']=='Yulieth Aguirre','Role'] = 'Coordinator'
df_excluded.loc[df_excluded['Employee']=='yudisel tubella','Role'] = 'Technician'

df_excluded['Role'].fillna('Other', inplace=True)

df_excluded.head()

C:\Users\jmeza.WOODFIELD\.conda\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1684: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
C:\Users\jmeza.WOODFIELD\.conda\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1817: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)
C:\Users\jmeza.WOODFIELD\.conda\envs\PythonData\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime,hour,minute,second,Time,Role
1,10,Emerginnova,Eme-2-99306,2022-04-21 17:37:20.000,Picking,Carlos Gomez,04-08-04-04,0 days 00:00:45.033000,0.0,0.0,45.0,0.750000,Technician
5,10,ISDIN Corporation,0085553655,2022-04-07 11:14:23.120,Picking,Hugo Gonzales,34-02-01-B,0 days 00:01:04.043000,0.0,1.0,4.0,1.066667,Technician
6,10,ISDIN Corporation,0085553655,2022-04-07 11:15:29.077,Picking,Hugo Gonzales,Aisle-33,0 days 00:01:05.957000,0.0,1.0,5.0,1.083333,Technician
10,10,ISDIN Corporation,0085553656,2022-04-07 11:24:59.983,Picking,Hugo Gonzales,33-08-01-A,0 days 00:01:09.020000,0.0,1.0,9.0,1.150000,Technician
11,10,ISDIN Corporation,0085553656,2022-04-07 11:25:49.640,Picking,Hugo Gonzales,33-05-01-B,0 days 00:00:49.657000,0.0,0.0,49.0,0.816667,Technician

In [47]:
# Displaying New Employees
df_excluded.loc[df_excluded['Role'] == 'Other']

Empty DataFrame
Columns: [Warehouse, Project, Shipment, Date, Operation, Employee, Location, PickingTime, hour, minute, second, Time, Role]
Index: []

In [48]:
# Save Employees Roles in a CSV File
df_employees = df_excluded.groupby(['Warehouse', 'Employee', 'Role']).size().reset_index(name='Freq')
df_employees = df_employees[['Warehouse','Employee', 'Role']]

df_employees.to_csv('data/employees_roles.csv')
df_employees.head()

  Warehouse       Employee         Role
0        10  Andre Jocelin   Technician
1        10      Andre Nau   Technician
2        10  Carl Ambroise           IT
3        10   Carlos Gomez   Technician
4        10    Carly Potts  Coordinator

In [32]:
# Save data in tableau pickers
df_excluded.to_csv('data/tableau_pickers.csv')
df_excluded.tail()

,Warehouse,Project,Shipment,Date,Operation,Employee,Location,PickingTime,hour,minute,second,Time
1173,19,"GCH Granules USA, Inc.",TR-RHCL-Care-04272022,2022-04-27 08:45:33.530,Picking,Brad Bacchetti,35-07-01-A,0 days 00:00:53.893000,0.0,0.0,53.0,0.883333
1174,19,"GCH Granules USA, Inc.",TR-RHCL-Care-04272022,2022-04-27 08:58:05.047,Picking,Brad Bacchetti,37-01-05-B,0 days 00:12:31.517000,0.0,12.0,31.0,12.516667
1175,19,"GCH Granules USA, Inc.",TR-RHCL-Care-04272022,2022-04-27 09:01:02.987,Picking,Brad Bacchetti,37-03-05-A,0 days 00:02:57.940000,0.0,2.0,57.0,2.950000
1176,19,"GCH Granules USA, Inc.",TR-RHCL-Care-04272022,2022-04-27 09:02:53.040,Picking,Brad Bacchetti,37-04-05-A,0 days 00:01:50.053000,0.0,1.0,50.0,1.833333
1177,19,"GCH Granules USA, Inc.",TR-RHCL-Care-04272022,2022-04-27 09:03:21.947,Picking,Brad Bacchetti,37-11-04-A,0 days 00:00:28.907000,0.0,0.0,28.0,0.466667

In [ ]:
# Close connection
cnxn.close()

# All Operation Codes

In [80]:
# Connect to the Database
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "Trusted_Connection=yes;")

In [81]:
df_all = pd.read_sql_query("DECLARE @from date, @to date;\
    SELECT @from = '2022-04-01', @to = '2022-04-26';\
    SELECT t.completedDateTime Date, oc.name Operation, w.name Warehouse,\
           p.name Project, m.lookupCode Material, employee Employee, s.lookupCode Shipment, isnull(s.waveId, ps.waveId) Wave,\
           ordersPerWave.shipmentsCount OrdersPerWave, lc.name Location, occ.name OrderClass, t.actualInventoryAmount Amount\
    FROM datex_footprint.Tasks t\
        join datex_footprint.OperationCodes oc\
            on oc.id = t.operationCodeId\
        left join datex_footprint.Warehouses w\
            on w.id = t.warehouseId\
        left join datex_footprint.Projects p\
            on p.id = t.projectId\
        left join datex_footprint.Materials m\
            on m.id = t.materialId\
        left join datex_footprint.Shipments s\
        inner join datex_footprint.ShipmentOrderLookup sol\
        inner join datex_footprint.orders o\
            on o.id = sol.orderId\
            on sol.shipmentId = s.id\
            on s.id = t.shipmentId\
        left join datex_footprint.OrderClasses occ\
            on occ.id = o.orderClassId\
        left join datex_footprint.PickSlips ps\
            on ps.id = t.pickSlipId\
        left join datex_footprint.LocationContainers lc\
            on lc.id = t.actualSourceLocationId\
        outer apply (\
            select\
                count(distinct tt.shipmentId) shipmentsCount\
                from datex_footprint.waves ww\
                    inner join datex_footprint.PickSlips ppss\
                    inner join datex_footprint.tasks tt\
                        on tt.operationCodeId = 8 and tt.pickSlipId = ppss.id\
                        on ppss.waveId = ww.id\
                where ww.id = isnull(s.waveId, ps.waveId)) ordersPerWave\
    where t.completedDateTime >= @from and t.completedDateTime < @to and t.statusId = 2 and s.lookupCode not like '%TEST%'\
    and t.employee != 'Foot Print Service'\
    order by s.lookupCode, t.completedDateTime", cnxn)

In [82]:
df_all.tail()

,Date,Operation,Warehouse,Project,Material,Employee,Shipment,Wave,OrdersPerWave,Location,OrderClass,Amount
102055,2022-04-05 10:37:09.680,Picking Completed,19,"Zymergen, Inc.",None,Brad Bacchetti,ZYM4522,233212.0,1,None,Sales Order,NaN
102056,2022-04-06 09:31:00.943,ShipmentLoading,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,19-HH1,Sales Order,NaN
102057,2022-04-06 09:31:01.097,ShipmentLoading,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,19-HH1,Sales Order,NaN
102058,2022-04-06 09:31:01.170,ShipmentLoading,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,19-HH1,Sales Order,NaN
102059,2022-04-06 09:31:06.217,Shipment Confirmation,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,None,Sales Order,NaN

In [83]:
# Group Employees into Roles

df_all.loc[df_all['Employee']=='Aisha Cooper','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Alejandro Aguirre','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Andre Jocelin','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Andre Nau','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Angel Luna','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Angela Briceno','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Angela Pena','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Baldomero Ramos','Role'] = 'Technician' ##### Duplicate Name

df_all.loc[df_all['Employee']=='Brad Bacchetti','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Brittany Owen','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Caleb Naranjo','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Carl Ambroise','Role'] = 'IT'

df_all.loc[df_all['Employee']=='Carlos Chavez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Carlos Gomez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Carly Potts','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Carolina Martinez','Role'] = 'Warehuose Manager'

df_all.loc[df_all['Employee']=='Casey Brown','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Chris Martin','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Dan Parisi','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Danielle Lucas','Role'] = 'Coordinator'

df_all.loc[df_all['Employee']=='Diana Martinez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Diego Londono','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Djenyson Sanon','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Dyenyson Sanon','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Doris Hernandez','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Doris Hincapie','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Edilberto Souza','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Edwin Perez','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Ernest Ferguson','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Felix Blanco','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Frantz Laman','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Gabriela Sanchez','Role'] = 'Coordinator'

df_all.loc[df_all['Employee']=='Gonzalo Guzman','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Gregory Watts','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Haydee Moreno','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Hector Gonzalez','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Hernando Sanchez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Hugo Gonzales','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Isaiah Lyng','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Jackson Pierre','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Jairo Rincon','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Jamarcus Cook','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Janeth Briceno','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Jayalakshmi Arcot','Role'] = 'Coordinator'

df_all.loc[df_all['Employee']=='Jaycob Albert','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='John Puskarik','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Jorge Lopez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Jose Rodriguez','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Juan Castro','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Juan Morales','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Julio Meza','Role'] = 'IT'
df_all.loc[df_all['Employee']=='Justin Johnson','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Justin Runsdorf','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Karen Hernandez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Katherine Moncada','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Keith Barker','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Lazaro Galindo','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Liliana Puentes','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Luci Nicley','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Maria Ramos','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Martha Hurtado','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Marzetta Bracken','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Matthew Gordon','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Matthew Shipley','Role'] = 'Coordinator'

df_all.loc[df_all['Employee']=='Micah Powers','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Misael Flores','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Mysel Pichardo','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Nelson Hurtado','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Nicklas Schmidt','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Odessa Sullen','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Omar Robles','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Ramos Baldomero','Role'] = 'Coordinator' ##### Duplicate Name

df_all.loc[df_all['Employee']=='Raul Bejarano','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Reggie Bracken','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Rita Geldres','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Rodmann Ramos','Role'] = 'IT'

df_all.loc[df_all['Employee']=='Ronald Celis','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Sandra Alvarez','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Sandra Vega','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Sergio Piura','Role'] = 'Warehuose Manager'

df_all.loc[df_all['Employee']=='Shannon Williamson','Role'] = 'Warehuose Manager'
df_all.loc[df_all['Employee']=='Shawn Saunders','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Shipping','Role'] = 'Anybody'
df_all.loc[df_all['Employee']=='Sujelin Soto-Orta','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Thalia Rivera','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='Tyler Gonzales','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Warehouse','Role'] = 'Anybody'
df_all.loc[df_all['Employee']=='Wayne Gray','Role'] = 'Technician'

df_all.loc[df_all['Employee']=='Wendy Medrano','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='William Trevino Trevino','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Yaima Castillo','Role'] = 'Technician'
df_all.loc[df_all['Employee']=='Yulieth Aguirre','Role'] = 'Coordinator'
df_all.loc[df_all['Employee']=='yudisel tubella','Role'] = 'Technician'

df_all['Role'].fillna('Other', inplace=True)

df_all.head()

,Date,Operation,Warehouse,Project,Material,Employee,Shipment,Wave,OrdersPerWave,Location,OrderClass,Amount,Role
0,2022-04-14 13:01:08.127,ShipmentLoading,20,None,None,Brittany Owen,,231305.0,1,20-HH1,Sales Order,NaN,Technician
1,2022-04-14 13:02:24.947,Shipment Confirmation,20,None,None,Brittany Owen,,231305.0,1,None,Sales Order,NaN,Technician
2,2022-04-21 17:36:34.967,Scanned Shipment,10,Emerginnova,None,Carlos Gomez,Eme-2-99306,235062.0,1,None,Sales Order,NaN,Technician
3,2022-04-21 17:37:20.000,Picking,10,Emerginnova,ATD310B,Carlos Gomez,Eme-2-99306,235062.0,1,04-08-04-04,Sales Order,1.0,Technician
4,2022-04-21 17:38:02.983,Picking Completed,10,Emerginnova,None,Carlos Gomez,Eme-2-99306,235062.0,1,None,Sales Order,NaN,Technician

In [84]:
# Displaying New Employees
df_all.loc[df_all['Role'] == 'Other']

,Date,Operation,Warehouse,Project,Material,Employee,Shipment,Wave,OrdersPerWave,Location,OrderClass,Amount,Role
51275,2022-04-18 11:54:55.273,UnPick LicensePlate,15,None,None,WOODFIELD\cmartinez,7901684 (C6343397),234536.0,17,15-HH2,Sales Order,NaN,Other
85504,2022-04-05 16:42:50.713,UnPick LicensePlate,10,None,None,WOODFIELD\jarcot,MET207798 (C6224754),231462.0,1,Door Zone-2248,Sales Order,NaN,Other

In [85]:
# Save Employees Roles in a CSV File
df_employees = df_all.groupby(['Warehouse', 'Employee', 'Role']).size().reset_index(name='Freq')
df_employees = df_employees[['Warehouse','Employee', 'Role']]

df_employees.to_csv('data/employees_roles.csv')
df_employees.head()

  Warehouse        Employee         Role
0        10   Andre Jocelin   Technician
1        10       Andre Nau   Technician
2        10  Angela Briceno  Coordinator
3        10     Angela Pena  Coordinator
4        10   Brittany Owen   Technician

In [86]:
# Save data in tableau pickers
df_all.to_csv('data/tableau_all.csv')
df_all.tail()

,Date,Operation,Warehouse,Project,Material,Employee,Shipment,Wave,OrdersPerWave,Location,OrderClass,Amount,Role
102055,2022-04-05 10:37:09.680,Picking Completed,19,"Zymergen, Inc.",None,Brad Bacchetti,ZYM4522,233212.0,1,None,Sales Order,NaN,Coordinator
102056,2022-04-06 09:31:00.943,ShipmentLoading,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,19-HH1,Sales Order,NaN,Technician
102057,2022-04-06 09:31:01.097,ShipmentLoading,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,19-HH1,Sales Order,NaN,Technician
102058,2022-04-06 09:31:01.170,ShipmentLoading,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,19-HH1,Sales Order,NaN,Technician
102059,2022-04-06 09:31:06.217,Shipment Confirmation,19,None,None,Carlos Chavez,ZYM4522,233212.0,1,None,Sales Order,NaN,Technician

In [87]:
# Close connection
cnxn.close()

In [98]:
df_all['Operation'].sort_values().unique()

array(['Count', 'DONE RECEIVING', 'DRIVER CHECK IN', 'Finished Receiving',
       'Inbound Shipment Cancellation', 'Inventory Adjustment',
       'License Plate Pick', 'Manual Pick Allocation',
       'Measurement Sampling', 'Outbound Shipment Cancellation',
       'Packing Inventory', 'Picking', 'Picking Completed',
       'Picking Initiated PC', 'PutAway', 'Rate And Ship', 'Receiving',
       'Recount', 'Scanned Shipment', 'SerialNumber Creation',
       'SerialNumber Move', 'SerialNumber Ship Out',
       'Shipment Confirmation', 'Shipment Line Cancel Outstanding',
       'ShipmentLoading', 'Truck Arrived', 'UnPick Inventory',
       'UnPick LicensePlate'], dtype=object)